STMicroelectronics/STM32CubeG0/Middlewares/ST/STM32_USBPD_Library/Core/src/usbpd_dpm_core.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    usbpd_dpm_core.c
  * @author  MCD Application Team
  * @brief   USBPD dpm core file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

#define __USBPD_DPM_CORE_C

/* Includes ------------------------------------------------------------------*/
#include "usbpd_core.h"
#include "usbpd_trace.h"
#include "usbpd_dpm_core.h"
#if !defined(USBPDCORE_LIB_NO_PD) || defined(USBPD_TYPE_STATE_MACHINE)
#include "usbpd_dpm_user.h"
#endif /* !USBPDCORE_LIB_NO_PD || USBPD_TYPE_STATE_MACHINE */
#include "usbpd_dpm_conf.h"

#if defined(USBPD_TCPM_MODULE_ENABLED)
#if defined(USBPD_STUSB1605)
#include "p-nucleo-usb002.h"
#else
#include "usbpd_tcpci.h"
#endif /*USBPD_STUSB1605*/
#endif /* USBPD_TCPM_MODULE_ENABLED */

#ifdef _RTOS
#include "cmsis_os.h"
#if (osCMSIS >= 0x20000U)
#include "task.h"
#endif /* osCMSIS >= 0x20000U */
#else
#if defined(USE_STM32_UTILITY_OS)
#include "utilities_conf.h"
#endif /* USE_STM32_UTILITY_OS */
#if defined(USBPD_TCPM_MODULE_ENABLED)
#include "usbpd_timersserver.h"
#endif /* USBPD_TCPM_MODULE_ENABLED */
#endif /* _RTOS */

#if defined(_FWUPDATE_RESPONDER)
#include "usbpd_pdfu_responder.h"
#endif /* _FWUPDATE_RESPONDER */

#if defined(_LOW_POWER)
#include "usbpd_lowpower.h"
#endif

/* Generic STM32 prototypes */
extern uint32_t HAL_GetTick(void);

/* Private function prototypes -----------------------------------------------*/
#ifdef _RTOS
#if (osCMSIS < 0x20000U)
#if !defined(USBPDCORE_LIB_NO_PD)
void USBPD_PE_Task(void const *argument);
#endif /* !USBPDCORE_LIB_NO_PD */
#if defined(USBPD_TCPM_MODULE_ENABLED)
void USBPD_ALERT_Task(void const *argument);
#else
#if !defined(USBPDCORE_LIB_NO_PD) || defined(USBPD_TYPE_STATE_MACHINE)
void USBPD_CAD_Task(void const *argument);
#endif /* !USBPDCORE_LIB_NO_PD || USBPD_TYPE_STATE_MACHINE */
#endif /* USBPD_TCPM_MODULE_ENABLED */

#else /* osCMSIS >= 0x20000U */

#if !defined(USBPDCORE_LIB_NO_PD)
void USBPD_PE_Task_P0(void *argument);
void USBPD_PE_Task_P1(void *argument);
static void PE_Task(uint32_t PortNum);
#endif /* !USBPDCORE_LIB_NO_PD */
#if defined(USBPD_TCPM_MODULE_ENABLED)
void USBPD_ALERT_Task(void *argument);
#else
#if !defined(USBPDCORE_LIB_NO_PD) || defined(USBPD_TYPE_STATE_MACHINE)
void USBPD_CAD_Task(void *argument);
#endif /* !USBPDCORE_LIB_NO_PD || USBPD_TYPE_STATE_MACHINE */
#endif /* USBPD_TCPM_MODULE_ENABLED */

#endif /* osCMSIS < 0x20000U */
#else /* !_RTOS */

#if !defined(USBPDCORE_LIB_NO_PD) || defined(USBPD_TYPE_STATE_MACHINE)
void USBPD_CAD_Task(void);
#if defined(USE_STM32_UTILITY_OS)
void TimerCADfunction(void *);
#endif /* USE_STM32_UTILITY_OS */
#endif /* !USBPDCORE_LIB_NO_PD || USBPD_TYPE_STATE_MACHINE */

#if !defined(USBPDCORE_LIB_NO_PD)
void USBPD_PE_Task_P0(void);
void USBPD_PE_Task_P1(void);
#if defined(USE_STM32_UTILITY_OS)
void TimerPE0function(void *pArg);
void TimerPE1function(void *pArg);
#endif /* USE_STM32_UTILITY_OS */
#endif /* !USBPDCORE_LIB_NO_PD  */

void USBPD_TaskUser(void);


#endif /* _RTOS */

/* Private typedef -----------------------------------------------------------*/
#ifdef _RTOS
#if (osCMSIS < 0x20000U)
#define DPM_STACK_SIZE_ADDON_FOR_CMSIS              1
#else
#define DPM_STACK_SIZE_ADDON_FOR_CMSIS              4
#endif /* osCMSIS < 0x20000U */
#if !defined(USBPDCORE_LIB_NO_PD)
#define FREERTOS_PE_PRIORITY                    osPriorityAboveNormal
#if defined(_VDM)
#define FREERTOS_PE_STACK_SIZE                  (350 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#elif defined(__AUTHENTICATION__)
#define FREERTOS_PE_STACK_SIZE                  (350 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#else
#define FREERTOS_PE_STACK_SIZE                  (200 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#endif /*_VDM*/
#endif /* !USBPDCORE_LIB_NO_PD */
#if defined(USBPD_TCPM_MODULE_ENABLED)
#define FREERTOS_ALERT_PRIORITY                 osPriorityRealtime
#define FREERTOS_ALERT_STACK_SIZE               (240 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#else
#define FREERTOS_CAD_PRIORITY                   osPriorityRealtime
#define FREERTOS_CAD_STACK_SIZE                 (300 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#endif /*USBPD_TCPM_MODULE_ENABLED*/

#if (osCMSIS < 0x20000U)
#if !defined(USBPDCORE_LIB_NO_PD)
osThreadDef(PE_0, USBPD_PE_Task, FREERTOS_PE_PRIORITY, 0, FREERTOS_PE_STACK_SIZE);
osThreadDef(PE_1, USBPD_PE_Task, FREERTOS_PE_PRIORITY, 0, FREERTOS_PE_STACK_SIZE);
osMessageQDef(queuePE, 1, uint16_t);
#endif /* !USBPDCORE_LIB_NO_PD */
#if defined(USBPD_TCPM_MODULE_ENABLED)
osThreadDef(ALERTTask, USBPD_ALERT_Task, FREERTOS_ALERT_PRIORITY, 0, FREERTOS_ALERT_STACK_SIZE);
#else
#if !defined(USBPDCORE_LIB_NO_PD) || defined(USBPD_TYPE_STATE_MACHINE)
osThreadDef(CAD, USBPD_CAD_Task, FREERTOS_CAD_PRIORITY, 0, FREERTOS_CAD_STACK_SIZE);
osMessageQDef(queueCAD, 2, uint16_t);
#endif /* !USBPDCORE_LIB_NO_PD || USBPD_TYPE_STATE_MACHINE */
#endif /* USBPD_TCPM_MODULE_ENABLED */
#else /* osCMSIS >= 0x20000U */

#if !defined(USBPDCORE_LIB_NO_PD)
osThreadAttr_t PE0_Thread_Atrr = {
  .name       = "PE_0",
  .priority   = FREERTOS_PE_PRIORITY, /*osPriorityAboveNormal,*/
  .stack_size = FREERTOS_PE_STACK_SIZE
};
osThreadAttr_t PE1_Thread_Atrr = {
  .name       = "PE_1",
  .priority   = FREERTOS_PE_PRIORITY,
  .stack_size = FREERTOS_PE_STACK_SIZE
};
#endif /* !USBPDCORE_LIB_NO_PD */

#if defined(USBPD_TCPM_MODULE_ENABLED)
osThreadAttr_t ALERT_Thread_Atrr = {
  .name       = "ALERTTask",
  .priority   = FREERTOS_ALERT_PRIORITY, /*osPriorityRealtime,*/
  .stack_size = FREERTOS_ALERT_STACK_SIZE
};
#else
#if !defined(USBPDCORE_LIB_NO_PD) || defined(USBPD_TYPE_STATE_MACHINE)
osThreadAttr_t CAD_Thread_Atrr = {
  .name       = "CAD",
  .priority   = FREERTOS_CAD_PRIORITY, /*osPriorityRealtime,*/
  .stack_size = FREERTOS_CAD_STACK_SIZE
};
#endif /* !USBPDCORE_LIB_NO_PD || USBPD_TYPE_STATE_MACHINE */
#endif /* USBPD_TCPM_MODULE_ENABLED */
#endif /* osCMSIS < 0x20000U */

